{
  "rice": "Rice grows best in clayey or loamy soil with good water retention. It requires warm temperatures, plenty of water, and acidic to neutral pH (5.5 to 7.0).",
  "maize": "Maize thrives in well-drained loamy soil with a neutral pH (6.0 to 7.5). It prefers warm climates and moderate rainfall.",
  "chickpea": "Chickpea grows well in well-drained loamy or sandy soil. It prefers dry, cool weather with a neutral to slightly alkaline pH (6.0 to 8.0). Avoid waterlogging.",
  "kidneybeans": "Kidney beans need warm temperatures and well-drained loamy soil. They prefer a neutral pH (6.0 to 7.0) and require moderate moisture.",
  "pigeonpeas": "Pigeon pea grows best in light, well-drained loamy soils. It tolerates drought and prefers a pH between 5.0 and 7.0.",
  "mothbeans": "Moth beans thrive in sandy or loamy soil under hot and dry conditions. They need minimal water and prefer slightly acidic to neutral pH.",
  "mungbean": "Mung bean prefers well-drained loamy soil and a warm, dry climate. It grows well in pH 6.2 to 7.2 with adequate sunlight.",
  "blackgram": "Black gram grows in loamy or clayey soils with good moisture retention. It prefers warm temperatures and a pH of 6.0 to 7.5.",
  "lentil": "Lentils do well in loamy soil with good drainage. They require cool climates and grow best in a pH range of 6.0 to 8.0.",
  "pomegranate": "Pomegranates need well-drained loamy or sandy soil. They grow well in hot, dry climates with a pH between 5.5 and 7.5.",
  "banana": "Banana thrives in rich, well-drained loamy soil with high organic content. It requires warm, humid weather and pH 5.5 to 7.0.",
  "mango": "Mango trees prefer deep, well-drained loamy soil. They need warm climates and grow best at pH 5.5 to 7.5.",
  "grapes": "Grapes grow well in sandy-loam or clay-loam soils. They prefer warm weather and a pH between 5.5 and 7.0 with good drainage.",
  "watermelon": "Watermelons thrive in sandy-loam soil with excellent drainage. They need hot, sunny weather and a pH between 6.0 and 7.5.",
  "muskmelon": "Muskmelon prefers sandy or loamy soil with high organic content. Needs warm, dry weather and grows best in pH 6.0 to 6.8.",
  "apple": "Apple trees grow well in loamy soils with good drainage. They prefer cold climates and a pH between 5.5 and 6.5.",
  "orange": "Oranges need sandy-loam soil with good drainage. They grow well in tropical climates and require a pH between 5.5 and 6.5.",
  "papaya": "Papaya grows best in well-drained sandy-loam soil. It requires a warm, frost-free climate and a pH of 6.0 to 6.5.",
  "coconut": "Coconut trees prefer sandy or loamy soil in coastal regions. They require high humidity, consistent rainfall, and a pH of 5.5 to 7.0.",
  "cotton": "Cotton grows well in black or alluvial soil. Needs hot, dry climate with adequate moisture and pH of 6.0 to 7.5.",
  "jute": "Jute prefers alluvial soil in humid areas. Requires high rainfall and a pH of 6.0 to 7.5.",
  "coffee": "Coffee grows best in well-drained loamy soil rich in organic matter. Prefers cool to warm climates and slightly acidic pH (5.0 to 6.5)."
}
